[
  {
    "id": 1,
    "name": "Hal Jordan",
    "group": "Green Lanterns",
    "imgIcon": "imgs/portraits/halicon.png",
    "img": "imgs/image/hal.png",
    "info": "Hal Jordan was born in Coast City to Martin Jordan and Jessica Jordan, The middle child of three children. He lived with his older brother Jack and a younger brother Jim. As a young child, he idolized his father, a test pilot who worked for Ferris Aircraft. At a very young age, he had to face his greatest fears when his father died in a plane crash right before his eyes. Despite his family's wishes, he followed in his father's footsteps and eventually joined the United States Air Force on his 18th birthday. Many years later after witnessing the death of a shipwrecked alien by the name  of Abin Sur, member of the Green Lantern Corps, the power ring then chose Hal as Abins' replacementbecause of his ability to overcome great fear. Hal then went on to be trained by drill sergeant Kilowog, and his former mentor, now nemasis Sinestro."
  },
  {
    "id": 2,
    "name": "Thaal Sinestro",
    "group": "Sinestro Corps",
    "imgIcon": "imgs/portraits/sinestro.png",
    "img": "imgs/image/sinestro.png",
    "info": "Thaal Sinestro of Korugar is the arch-nemesis of Green Lantern. At one point the greatest member of the Green Lantern Corps, he was corrupted by his power and exiled for crimes against his own people. He now seeks to impose his own order and control onto the universe, employing a yellow power ring to combat the green he has grown to despise. His prowess and ruthlessness have made him one of the most feared villains in existence, and eventually he establishes his own Sinestro Corps."
  },
  {
    "id": 3,
    "name": "Saint Walker", 
    "group": "Blue Lantern",
    "imgIcon": "imgs/portraits/StWalker.png",
    "img": "imgs/image/walker.png",
    "info": "A highly religious man on the world Astonia, Bro'Dee \"Saint\" Walker and his people faced a dying sun, which resulted in terror and panicked violence in his streets. He took his family on a journey of enlightenment atop a nearby mountain prophesied to present a messiah who Walker believed would guide them to salvation. Along the way, Walker witnessed his family die one by one as dangers along the journey became fiercer. Even still, Walker's hope never wavered, and when he reached the top, finding it empty, he refused to give up hope, and realized he was the savior spoken of. Walker delivered a message of hope back to his people before Ganthet and Sayd helped replenish his dying sun and presented him with a Blue Lantern power ring, so he could share his capacity for hope throughout the galaxy. "
  },
  {
    "id": 4,
    "name": "Carol Ferris", 
    "group": "Star Sapphire",
    "imgIcon": "imgs/portraits/carolicon.png",
    "img": "imgs/image/carol.png",
    "info": "Carol Ferris is the boss and on-off love interest of Hal Jordan. Her family owns the Ferris Aircraft company, she acts as an executive, and occasionally as a pilot. She is also Star Sapphire, a once villainous role occupying another part of her personality entirely. In the Star Sapphire Corps, where she fights for love across the universe."
  },
  {
    "id": 5,
    "name": "Lyssa Drak", 
    "group": "Sinestro Corps",
    "imgIcon": "imgs/portraits/lyssaicon.png",
    "img": "imgs/image/lyssa.png",
    "info": "Lyssa Drak is a member of the Sinestro Corps and the keeper of the book of Parallax, which is chained to her wrist. She maintains the horror stories and exploits of the members of the Sinestro Corps. When new recruits are brought to Qward, Lyssa oversees their entry into the Fear Lodge, and chronicles the new recruit's success or failure."
  },
  {
    "id": 6,
    "name": "Kilowog",
    "group": "Green Lantern",
    "imgIcon": "imgs/portraits/kilowogicon.png",
    "img": "imgs/image/kilowog.png",
    "info": "Kilowog was a geneticist and one of the Bolovaxians most brilliant minds. He hailed from the planet Bolovax Vik, which was one of the most crowded worlds in the universe; it had sixteen billion residents with a communal mind. After the previous Lantern, Branwilla, died, Kilowog was chosen to be a member of the Green Lantern Corps. It was a great honor, but it meant leaving Bolovax Vik and going into space on missions; this was tantamount to exile for a Bolovaxian. Nevertheless, Kilowog carried out his duties with pride. He would go on to be one of the Corps' best recruiters and trainers. During the Crisis on Infinite Earths, Bolovax Vik was destroyed. His ring automatically protected Kilowog, but not his people. Acting quickly, he placed all sixteen billion life energies into his ring. By sheer force of his will, they survived until Kilowog found a suitable planet to release his people. Sadly, the planet was soon destroyed by Sinestro. Kilowog could not rescue them again. He was now alone and lonely for good. "
  },
  {
    "id": 7,
    "name": "Kyle Rayner",
    "group": "White Lantern",
    "imgIcon": "imgs/portraits/kyleicon.png",
    "img": "imgs/image/kyle.png",
    "info": "Given the \"last\" Green Lantern Power Ring after the destruction of the Green Lantern Corps. Before he acquired a  Green Lantern ring, Kyle Rayner was a struggling but gifted freelance graphic artist. He lived and worked in Los Angeles initially. After Hal Jordan, grief-stricken over the destruction of his home town of Coast City, went on a mad rampage, killing the entire Green Lantern Corps and most of the Guardians of the Universe who oversee the Corps, Rayner was found by Ganthet, the last surviving Guardian, and given the last GL power ring. After saving the life of a construction worker in New York, Kyle Rayner was chosen to wield the other six rings in the Emotional Spectrum, in addition to his own green one. Soon after being attacked by Arkillo, Munk, Bleez and Fatality. They believed he had stolen the rings, Kyle unsuccessfully tried to explain that the rings were not, indeed, stolen by him, to no avail. Later, however, he was rescued by Saint Walker, who traveled with him to Oa seeking answers."
  },
  {
    "id": 8,
    "name": "John Stewart",
    "group": "Green Lantern",
    "imgIcon": "imgs/portraits/johnicon.png",
    "img": "imgs/image/john.png",
    "info": "John Stewart is an architect, later reconned into a veteran U.S. Marine from Detroit, Michigan, who was selected by the Guardians as a backup Green Lantern to then-current Green Lantern Hal Jordan, after the previous backup, Guy Gardner, was seriously injured after getting hit by a car while trying to save a civilian. Although Jordan objected to the decision after seeing that Stewart had a belligerent attitude to authority figures, the Guardians stood by their decision, and chided Jordan for his supposed bigoted outlook on the issue. Jordan explained that he just felt that even though Stewart might have the integrity for the task, he \"obviously would have a chip on his shoulder bigger than the rock of Gibraltar.\""
  },
  {
    "id": 9,
    "name": "Guy Gardener",
    "group": "Green Lantern",
    "imgIcon": "imgs/portraits/guyicon.png",
    "img": "imgs/image/guy.png",
    "info": "Guy Gardner is a top member of the Green Lantern Corps, and the second one to be chosen from Earth. His sheer willpower and his complete refusal to back down from any fight have made him one of the greatest warriors in the universe. This has also given him a notorious reputation in the superhero community as an obnoxious butthead. Despite the disapproval from his peers for his unrelenting offensive tendencies, he has always kept his chin up and refused to let the opinions of others stop him from doing what he knows is the right thing. A bit of a wild card in terms of attitude, and unwilling to listen to the strict restrictions that bind most of his fellow Lanterns, his determination, skill, and unpredictability have made him one of the most feared and respected lawmen in the universe."
  },
  {
    "id": 10,
    "name": "Ganthet",
    "group": "Guardian",
    "imgIcon": "imgs/portraits/gantheticon.png",
    "img": "imgs/image/ganthet.png",
    "info": "Ganthet is one of the Guardians of the Universe. However, where most of the Guardians are very stern 'by-the-book' characters, Ganthet has a personality that is more human-like, including displays of empathy and concern for an individual, instead of only thinking of the Green Lantern Corps. Ganthet is part of the Quintessence, a group of near-omnipotent beings who oversee the results of what happens on Earth."
  },
  {
    "id": 11,
    "name": "Sayd",
    "group": "Guardian",
    "imgIcon": "imgs/portraits/saydicon.png",
    "img": "imgs/image/sayd.png",
    "info": "Sayd was one of the reborn members of the Guardians of the Universe, and one of the few female members of the organization. Sayd's sensibilities were more in line with those of Ganthet, himself, a Guardian known for his non-traditional mindset. Sayd read a forbidden chapter from the Book of Oa, which foretold a prophecy of cosmic revelations, \"The Blackest Night\". When the threat of the Sinestro Corps loomed over the galaxy, Sayd addressed the incident to her colleagues as a sign from \"The Blackest Night\". Her Guardian brethren dismissed her concerns, treating the prophecy as nothing more than fable. Aware that Ganthet and Sayd were in love with each other, the others banished them from the Council of Guardians for committing the ultimate crime; that of feeling."
  },
  {
    "id": 12,
    "name": "Jessica Cruz",
    "group": "Green Lantern",
    "imgIcon": "imgs/portraits/jessicon.png",
    "img": "imgs/portraits/jessicon.png",
    "info": "After the power ring from Earth-3 was destroyed in the Darksied War, A Green Lantern ring chose her to be Earth's newest Green Lantern. Despite being chosen to be a Green Lantern, she still struggles with anxiety issues. In the new series Green Lanterns, Hal has forced Jessica and fellow rookie Simon Baz to protect Earth as partners, even sing their power batteries to ensure their cooperation. Currently, she and Baz are working to stop the Red Lantern Corps attempt to take over the planet. Concurrently, the duo operates alongside the Justice League in their newest series."
  },
  {
    "id": 13,
    "name": "Paralax Entity",
    "group": "Sinestro Corps",
    "imgIcon": "imgs/portraits/paraicon.png",
    "img": "imgs/image/para.png",
    "info": "Parallax is a demonic parasitic entity dating back to the dawn of time. This parasite was the sentient embodiment of fear, travelling from world to world and causing  entire civilizations to destroy themselves out of paranoia. The Guardians of the Universe imprisoned Parallax within the Central Power Battery on Oa using fear's opposite energy, willpower. Parallax had lain dormant for billions of years, its true nature hidden by the Guardians to prevent anyone from trying to free it. Being yellow in color, Parallax eventually came to be referred to as simply \"the yellow impurity.\""
  },
  {
    "id": 14,
    "name": "Iroque",
    "group": "Indigo Tribe",
    "imgIcon": "imgs/portraits/indigoicon.png",
    "img": "imgs/image/indigo.png",
    "info": "Iroque also known as Indigo-1 is the name of a mysterious woman who became the leader of the Indigo Tribe; a group that harnessed the Indigo Light of Compassion of the Emotional Spectrum. At some point in the past, she claimed she was self-centered and self-important until she met Abin Sur. After which, she became devoted to completing his mission in stopping The Blackest Night."
  },
  {
    "id": 15,
    "name": "Larfleeze",
    "group": "Agent Orange",
    "imgIcon": "imgs/portraits/larfleezeicon.png",
    "img": "imgs/image/larfleeze.png",
    "info": "The origins of Larfleeze, also known as Agent Orange, remain shrouded in mystery, largely due to the actions of the Guardians of the Universe. He revealed that his  people were farmers and he was considered ugly as a child. He was mistreated by his parents, Larfloozee and Larflem, and his 16 siblings. Aliens called Lakadakians came to conquer his world. Larfleeze was forced to mate with a female prisoner named Brokia and they had many children. But they were sent off to distant worlds for slavery. One day he had an escape plan were he went on a corpse cart and clawed his way through a an incerator and led a revolt. According to his own account, Larfleeze was one part of a group of five thieves who wanted to pull off the greatest heist in the history of their guild. They raided the planet Maltus, where one of their own was lost, and stole several treasures, mainly a box and a map. The box was supposedly worth more than an entire star system, for it contained Parallax, the sentient embodiment of fear. The other thing they stole was a map made by the fallen Maltusian Krona, said to contain something very valuable. Making their way to Okaara, they entered the Forbidden Forest of Weeds. Another of their group was killed by the forest, and the others fell into a temple. Inside was an Orange Lantern Power Battery. Mesmerized by it, the three remaining thieves started fighting among themselves for the Lantern. The Guardians then arrived with a force of Manhunters. However, their power was drained by the orange light, and several Guardians and Manhunters were killed, along with a third member of the thieves, leaving only Larfleeze and Blooch remaining. The Guardians then said that all they wanted was the box containing Parallax. If the two would give it up, they would be allowed to keep the Orange Battery, as long as it stayed buried in the temple on Okaara. Additionally, only one could own the battery. Larfleeze and Blooch accepted the deal, and then fought to the death. Larfleeze won, and became the sole wielder of the Orange Battery, then known as Agent Orange."
  },
  {
    "id": 16,
    "name": "Soranik",
    "group": "Sinestro Corps",
    "imgIcon": "imgs/portraits/sorinakicon.png",
    "img": "imgs/image/sorinak.png",
    "info": "Soranik Natu is an alien super-hero known as Green Lantern and a member of the Green Lantern Corps. The Guardians of the Universe gave her a power ring fueled by willpower to protect Space Sector 1417. Her homeworld is the planet Korugar, and her father Sinestro was the greatest Green Lantern until he turned evil and took over the planet as a tyrant. She is an accomplished neurosurgeon who distrusts the Green Lanterns because of her hated father. Her mother was Arin Sur of the planet Ungara, sister of Abin Sur. Her original partner was Princess Iolande."
  },
  {
    "id": 17,
    "name": "Arkillo",
    "group": "Yellow Lantern",
    "imgIcon": "imgs/portraits/arkillo.png",
    "img": "imgs/image/arkillo.png",
    "info": "Arkillo was a member of the Sinestro Corps. A savage carnivore, Arkillo was recruited into the Sinestro Corps due to his ability to \"instill great fear\" in others.Taken to Qward, Arkillo's brutal nature allowed him to quickly advance in the ranks becoming the Corps drill sergeant and overseeing the creation of new Qwardian rings. He was a principal combatant during the Sinestro Corps War, particularly at the battles of Mogo and Ranx, where he fought one-on-one against his analog in the Green Lantern Corps, Kilowog."
  },
  {
    "id": 18,
    "name": "Mogo",
    "group": "Green Lantern",
    "imgIcon": "imgs/portraits/mogoicon.png",
    "img": "imgs/image/mogo.png",
    "info": "Mogo was a sentient or \"living\" planet. When it was desired, its affiliation with Green Lantern Corps was marked by its foliage that was arranged into a green band circling the body with the standard Corps lantern symbol. Mogo is also responsible for guiding the Green Lantern rings to new sentient beings after their hosts die."
  }
]